fix(README): add change diagram of work for a mermade version
